"""
Завдання 3.
Згідно з древньою індійською легендою творець гри в шахи за свій винахід попросив у раджі незначну на перший погляд
 винагороду: стільки пшеничних зерен, скільки опиниться на шаховій дошці, якщо на першу клітинку покласти одне зерно,
 на другу -- два зерна, на третю -- чотири, і т.д.. Виявилося, що такої кількості зерна немає на усій планеті
 (2**64-1 зерен). Напишіть програму, що вираховує починаючи з якої клітинки дошки раджі треба було віддати Nкг зерна,
 де N -- вводить користувач. Прийняти вагу однієї зернинки за 35мг.
 Номер клітинки виводити в букво-циферних традиційних шахових координатах.
"""


def main():
    weight_on_kilo = 35 / 1000000 # вага однієї зернинки, в кг
    total_grains = 0
    nomer_kletki = 1

    N = float(input("Enter weight that you have to return to Redgi in kg: "))

    while total_grains < N:
        grains_on_kletke = 2**(nomer_kletki - 1)
        total_grains += grains_on_kletke

total_weight = total_grains * weight_on_kilo

if __name__ == '__main__':
    main()
