# Написати програму, що вираховує суму усіх цифр трьохзначного числа введеного користувачем через input(). Виконати програму в двох варіантах:
# a) З використанням рядків (тобто після input заборонено приводити введене число до int/float/Decimal безпосередньо).
# Підказка: щоб отримати один символ рядку, треба використати квадратні дужки та індекс цього символу, індекси починаються з нуля: 'abcde'[2] == 'c'!

digits = input("Please enter a three-digit number: ")

print(int(digits[0]) + int(digits[1]) + int(digits[2]))