# Написати програму, що вираховує суму усіх цифр трьохзначного числа введеного користувачем через input(). Виконати програму в двох варіантах:
# a) З використанням рядків (тобто після input заборонено приводити введене число до int/float/Decimal безпосередньо).
# Підказка: щоб отримати один символ рядку, треба використати квадратні дужки та індекс цього символу, індекси починаються з нуля: 'abcde'[2] == 'c'!

digits = input("Please enter a three-digit number: ")

if len(digits) == 3:
    new = 0
    for x in range (len(digits)):
        new += int(digits[x])
    print(new)
else:
    print("Enter three digits")
