"""Завдання 4.
Напишіть програму, що запитує у користувача довільний рядок через input(), та для даного рядка виконує наступне:

виведить третій символ цього рядка.
виведить передостанній символ цього рядка.
виведить перші п'ять символів цього рядка.
виведить весь рядок, крім двох останніх символів.
виведить усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи з першого).
виведить усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
виведить усі символи у зворотному порядку.
виведить усі символи рядка через один у зворотному порядку, починаючи з останнього.
виведить довжину цього рядка.
Оформіть вивід кожного підпункту, щоб було зрозуміло, що саме виводиться. Тобто перед виводом результату треба ще вивести текст пояснення, що це."""

entered_words = input("Please enter your string: \n")
print(entered_words)

print('Third symbol:', entered_words[2], '\nBefore last symbol:', entered_words[-2])
print("Print first five symbols: ", entered_words[0:5])
print("Print para symbols: ", entered_words[0::2])
print("Print NOpara symbols: ", entered_words[1::2])
print("Print reverse: ", entered_words[::-1])
print("One by one print reverse: ", entered_words[::-2])
print("Lenght of string: ", len(entered_words))