"""
Завдання 3.
Дано список з чисел та рядків. Рядки у списку завжди непорожні та складаються тільки з символів 0123456789.
За допомогою функції sorted() отримати копію цього списку. Тип оригінальних елементів не має бути змінено,
тобто числа мають лишитися числами, рядки -- рядками.

a) Копія має бути відсортована за значенням числа елементу. Наприклад:
# original list
[5, '9', 0, '452', 6.5, '6', 1, 2]
# sorted list
[0, 1, 2, 5, '6', 6.5, '9', '452']

б) Копія має бути відсортована за значенням ПЕРШОЇ цифри числа. Наприклад (в прикладі немає помилки,
відсортовано правильно, за першою цифрою):
# original list
[472, 326, 1, 999.0, '1101000', '99', 9, '20', 863, '0']
# sorted list
['0', 1, '1101000', '20', 326, 472, 863, 999.0, '99', 9]
"""


def main():
    lst = [5, "9", 0, "452", 6.5, "6", 1, 2]
    lst2 = [472, 326, 1, 999.0, "1101000", "99", 9, "20", 863, "0"]

    # sorted_lst = sorted(lst, key=lambda x: float(x) if isinstance(x, str) and x.isdigit() else x)
    sorted_lst = sorted(lst, key=float)
    print(sorted_lst)

    sorted_lst2 = sorted(lst2, key=lambda x: str(x)[0])
    print(sorted_lst2)


if __name__ == "__main__":
    main()
